# 비교 연산자
# 비교 연산의 결과는 무조건 ture 또는 false로 나옴
# ==    : 같으면 ture 다르면 false
# !=    : 다르면 ture 같으면 false
# <
# >
# <=
# >=

# print(5 != 2)
# print(5 < 2)
# print(18 == 14)
# print (27 < 98)
# print (24 <= 20)
# print (39 >= 39)
# print (28 != 55)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 조건식 종류

#  [가장 일반적인 형식]
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드
# elif(조건식) :
#       위의 조건식이 false이고 elif의 조건식이 ture일 경우 실행할 경우
# else :
#       위의 모든 조건식이 false일 경우 실행할 코드


# [if만 사용한 경우]
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드


# {if와 elif만 사용한 경우}
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드
# elif(조건식) :
#       위의 조건식이 false이고 elif의 조건식이 ture일 경우 실행할 경우


# {if와 else만 사용한 경우}
#  [가장 일반적인 형식]
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드
# else :
#       위의 모든 조건식이 false일 경우 실행할 코드


#  위 형식들은 조건식이 있으며
# if는 무조건 1개,
# elif는 0개무터 무한대,
# else는 0개 또는 1개를 사용하여 조건문을 구성할 수 있음
# 조건문은 조건문 안에 종첨해서 사용할 수 있다.


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# score는 숫자로 입력받기
# 100 ~ 90 : A
# 89 ~ 70 : B
# 69 ~ 60 : C
# 59~ 0 : D

# score = int(input())            # 숫자로 입력 받음

# if(100 >= score >= 90):         # 조건문이 ture여서 실행될 경우 아래의 조건은 더 보지 말고 종료
#     print ('A')
# elif(89 >= score >= 90):   
#     print('B')
# elif(69 >= score >= 60):
#     print('C')
# elif(59 >= score >= 0):
#     print('D')

# print("end.")


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# print("나이가 12세 이상만 영화 관람이 가능합니다.")
# age = int(input("나이를 입력해주세요. "))
# if(12 > age):
#     print("죄송합니다.")
# elif(12 <= age):
#     print('즐거운 관람 되세요.')

# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# print("수를 입력해주세요.")
# number = int(input())
# if(number % 2 == 1):
#     print("홀수입니다")
# elif(number % 2 == 0):          # else: 이렇게 가능, 경우의 수가 2개만 있으면 if, else로 하는게 편한
#     print("짝수입니다")


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 논리 연산자
# not           : ture면 false, false면 ture로 결과를 뒤집음
# and           : 양옆이 전부 ture면 ture, 하나라도 false면 false
# or            : 양옆이 전부 false면 false, 하나라도 ture면 ture
# 실행 순서는 not, and , or 순서로 실행 됨

# a = 10
# b = 2
# if((a == 10) and (b == 2)):
#    print("a는 10 b는 2입니다.")

# if((a == 10) or (b == 2)):
#    print("a와 b 둘중 한게는 10 이상입니다")

# if(not(a == 5)): # (a != 5) 와 같음
#    print("a는 5가 아닙니다")


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 종첩 if
# if의 경우 종첩해서 사용가능
age = int(input("나이를 입력하세요: "))
is_member = input("회원 여부를 입력하세요 (yes or no): ")

if(age>=18) :
    print("회원님 안녕하세요")

    if(is_member == "yes") :
        print("성인 회원님, 환영합니다!")
    else :
        print("성인 비회원님 회원 가입을 해주세요.")
else :
    if(is_member == "yes") :
        print ("청소년 회원님 환영합니다!")
    else :
        print("청소년 비회원님 , 회원가입을 해주세요.")