# 비교 연산자
# 비교 연산의 결과는 무조건 ture 또는 false로 나옴
# ==    : 같으면 ture 다르면 false
# !=    : 다르면 ture 같으면 false
# <
# >
# <=
# >=

# print(5 != 2)
# print(5 < 2)
# print(18 == 14)
# print (27 < 98)
# print (24 <= 20)
# print (39 >= 39)
# print (28 != 55)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 조건식 종류

#  [가장 일반적인 형식]
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드
# elif(조건식) :
#       위의 조건식이 false이고 elif의 조건식이 ture일 경우 실행할 경우
# else :
#       위의 모든 조건식이 false일 경우 실행할 코드


# [if만 사용한 경우]
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드


# {if와 elif만 사용한 경우}
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드
# elif(조건식) :
#       위의 조건식이 false이고 elif의 조건식이 ture일 경우 실행할 경우


# {if와 else만 사용한 경우}
#  [가장 일반적인 형식]
# if(조건식) :
#       if의 조건식이 ture일 경우 실행할 코드
# else :
#       위의 모든 조건식이 false일 경우 실행할 코드


#  위 형식들은 조건식이 있으며
# if는 무조건 1개,
# elif는 0개무터 무한대,
# else는 0개 또는 1개를 사용하여 조건문을 구성할 수 있음
# 조건문은 조건문 안에 종첨해서 사용할 수 있다.


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# score는 숫자로 입력받기
# 100 ~ 90 : A
# 89 ~ 70 : B
# 69 ~ 60 : C
# 59~ 0 : D

score = int(input())            # 숫자로 입력 받음

if(100 >= score >= 90):         # 조건문이 ture여서 실행될 경우 아래의 조건은 더 보지 말고 종료
    print ('A')
elif(89 >= score >= 90):   
    print('B')
elif(69 >= score >= 60):
    print('C')
elif(59 >= score >= 0):
    print('D')

print("end.")