# list
# 변수 = ['값', 값]     => 값의 자료형은 상관 없음
# 위 형식으로 쓰임
# 리스트란 여러래의 자료형을 하나의 변수에 순서대로 모아둔 것
# 모아둔 자료형의 순서는 0부터 시작한다 => 인덱스(index) 번호라고 예기
# 리스트의 값을 가지고 올 때는 대괄호([])를 이용하여 참조

# list1 = [1, 'cit', True]
# print(list1)
# print(list1[0])          # list1 리스트에 0번재 값을 가지고 옴
# print(list1[2])
# print(list1[3])          # list1 리스트에 3번째 값은 없으므로 에러 발생     # 항상 인덱스는 0부터 시작함


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


#
# 인덱스 번호를 이용해서 해당 인데거스 번호에 있는 값을 수정할 수 있다.
# 값 변경은 변수에값을 저장하는 것처럼 진행하면 된다
# list1 = [1, 'cit', 'happy']
# print(list1)

# list1[2] = 'hello' # list1의 1번재 인덱스 값을 변경
# print(list1)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# list1 = ['abc', 'dfg', 'hij', 123, 456]
# print(list1)
# print()

# print("Q1 list1의 1번재 원소를 'park'으로 고치시오.")
# list1[1] = 'park'
# print(list1)
# print()

# print("Q2 변수 이름을 arr이라고 하고 아래 리스트를 대입(저장)하세요")
# arr = [4, 8, 12, 16, 20, 24, 28, 32]
# print(arr)
# print()

# print("Q3 arr의 4번째 원소를 'cit'로 하시오. 단 맨 왼쪽의 원소가 0번째 원소다")
# arr[4] = 'cit'
# print(arr)
# print()

# print("Q4 print(list1)와 print(arr)을 실행하시오")
# print(list1)
# print(arr)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #
