# for문
# for 변수 in range(start, end ,step):
#       반복할 코드
# 위 형식이 반복문의 기본 형태이며 종첩이 가능함

# range(start, end, step) 여기서 start end step은 정수(ex. range(1, 5, 2))
# start 부터 end 까지(END는 포한 안됨) step 만큼 증가/감소된 값을 변수에 넣고 반복
# start람 step은 생략 가능
# start를 생략하면 0
# step을 생략하면 1
# range(5)          => start와 step 둘다 생략된 상태
# range(0, 5)       => step이 생략된 상태
# range(0, 5 , 1)   => 완전한 상태
# 위 3가지 모양만 있음
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #

# for i in range(0, 5, 1):    # i변수 범위 (0,1,2,3,4)를 넣으면서 반복. 총 5번 반복
#     print(i)

# for i in range(0, 5, 1):
#     print('hello')          # 반복할 코드에 변수 사용 x


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1부터 100까지 홀수만을 출력
# for i in range(1, 101, 2):
#     print(i)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 5부터 100까지 5의 배수를 출력
# for i in range(5, 101, 5):
#     print(i)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1 부터 10000까지 제곱수를 출력
# for i in range(1,101,1):
#     print(i*i)


#

# while문
# while(조건식)
#       코드
# 위 형식으로 사용
#if문과 비슷하게 조건식이 ture일 경우 실행됨

# i = 0
# while(i < 5):
#     print(i)
#     i += 1       # i = i + 1 이랑 같은 뜻, 누적 덧셈


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1부터 100까지 짝수만을 출력
# i = 2
# while(i < 101):
#     print(i)
#     i += 2


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1부터 100까지 7의 배수를 출력
# i = 7
# while(i < 100):
#     print(i)
#     i += 7


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


#  1부터 100까지 분수를 출력
# i = 1
# while(i < 101):
#     print(100/i)
#     i += 1


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 1부터 100까지 분수를 출력
# i = 1
# while(i < 101):
#     print(100/i)
#     i += 1


# 1부터 100까지 분수를 출력         
# i = 1
# while(i < 101):     # 분수는 가장 큰 수 / i
#     print(1/i)
#     i += 1


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 무한반복
# pytion에서는
# while(ture):
#       코드 
# 위와 같이 while에 ture를 넣어 무한 반복이 가능함


# continue 와 break
# continue , break는 for , while 둘다 사용 가능
# continue
# continue를 만나는 순간 다음 반복 진행

# for i in range(0, 10, 1):
#     if(i%2 == 0):
#         continue
#     print(i)


# break
# break를 만나는 순간 반복문 종료 
# 보통인 경우 break는 if와 같이 사용

# i = 0
# while(True):
#     print(i)
#     if(i == 10):
#         break
#     i += 1


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# while(True):
#     print("메뉴를 선택해주새요")
#     print("1. hello 출력")
#     print("2. hi 출력")
#     print("3. exit")
#     memu = int(input())

#     if(memu == 1):
#         print("hello")
#     elif(memu == 2):
#         print("hi")
#     elif(memu == 3):
#         print("메뉴 프로그렘을 종료 합니다")
#         break
#     else:
#         print("잘못 입력했습니다. 1-3 숫자를 입력하세요")
#         print()
#         print()
#         continue

#     print()
#    print()


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 중첩 반복문
# 반복문 내부애 반목문아 았는 현식
# 반복문이 2번 종첩이면 이중첩 3번 중첩이면 3중첩 반복문이다. 실제로 3중첩 이상은 잘 사용 안함
# for x in range(1, 10, 1):           # 총 9번 반복
#     for y in range( 1, 10, 1) :     # 총 81번 반복
#         print(x, "*", y, "=", x*y)


 # ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


