# 변수(variable)
# 변수 (variable) = 값
# 위 형식으로 변수(variable)에 값을 저장
# =기호의 뜻과는 다르게 단순하개 값이 변수(variable)에 저장됨
# 변수 (variable)는 아래의 교칙을 지키면 원하는 대로 가능
# 1. 숫자로 시작 불가능
# 2. 기호 "_"를 제외한 특수문자 불가능
# 3. 띄어쓰기 불가능
# 4. 예약어 불가능

# my_name = "Isaac"


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 자료형(data type) : 값의 종류
# str   -> String       문자    => 따움표로 이루어져 있음(따음표가 있으면 무조건 문자) " "  ' '
# float -> Float        실수    => 따움표도 없고 소수점이 있으면 실수
# int   -> Integer      정수    => 따움표가 없고 소수점도 없으면 정수
# 일상적으로 사용하는 말들(영어, 중국어, 한국어 등)이 따움표가 없다=> 오류

# a = 10      # a라는 변수에 int 자료형인 10 저장
# b = 'cit'   # b 라는 변수에 str 자료형인 'cit' 저장


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


